In [1]:
import pandas as pd
import numpy as np
import re

pd.set_option('display.max_columns', None)  # me muestre todas las columnas
pd.set_option('display.max_colwidth', 100)  #me muestre más caracteres por columna.

import warnings
warnings.filterwarnings('ignore')

In [2]:
act = pd.read_csv(r'C:\Users\manue\OneDrive\Escritorio\Ironhack\w3-database-project\data\actor.csv', encoding= "ISO-8859-1") 
cat = pd.read_csv(r'C:\Users\manue\OneDrive\Escritorio\Ironhack\w3-database-project\data\category.csv', encoding= "ISO-8859-1") 
fil = pd.read_csv(r'C:\Users\manue\OneDrive\Escritorio\Ironhack\w3-database-project\data\film.csv', encoding= "ISO-8859-1") 
inv = pd.read_csv(r'C:\Users\manue\OneDrive\Escritorio\Ironhack\w3-database-project\data\inventory.csv', encoding= "ISO-8859-1") 
lan = pd.read_csv(r'C:\Users\manue\OneDrive\Escritorio\Ironhack\w3-database-project\data\language.csv', encoding= "ISO-8859-1") 
old = pd.read_csv(r'C:\Users\manue\OneDrive\Escritorio\Ironhack\w3-database-project\data\old_HDD.csv', encoding= "ISO-8859-1") 
ren = pd.read_csv(r'C:\Users\manue\OneDrive\Escritorio\Ironhack\w3-database-project\data\rental.csv', encoding= "ISO-8859-1")

## Exploramos columnas

In [3]:
print(act.columns)
print(cat.columns)
print(fil.columns)
print(inv.columns)
print(lan.columns)
print(old.columns)
print(ren.columns)

Index(['actor_id', 'first_name', 'last_name', 'last_update'], dtype='object')
Index(['category_id', 'name', 'last_update'], dtype='object')
Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update'],
      dtype='object')
Index(['inventory_id', 'film_id', 'store_id', 'last_update'], dtype='object')
Index(['language_id', 'name', 'last_update'], dtype='object')
Index(['first_name', 'last_name', 'title', 'release_year', 'category_id'], dtype='object')
Index(['rental_id', 'rental_date', 'inventory_id', 'customer_id',
       'return_date', 'staff_id', 'last_update'],
      dtype='object')

In [4]:
# Elimino la columna 'last_uptdate' de la tabla ren.

ren = ren.drop(['last_update'], axis=1)

In [5]:
# Así queda la tabla ren.
ren.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [6]:
ren.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 47.0+ KB

In [7]:
# Eliminamos las columnas 'last_update'
inv = inv.drop(['last_update'], axis=1)

In [8]:
# Así queda la tabla inv.
inv.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

In [9]:
inv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
dtypes: int64(3)
memory usage: 23.6 KB

In [10]:
# Hacemos varios cambios en la tabla fil.
fil.rename({'language_id': 'language'}, axis=1, inplace=True) # cambiar el nombre de la columna language
fil.rename({'original_language_id': 'original_language'}, axis=1, inplace=True) # cambiar el nombre de la columna original language
fil.language = 'English' #que todos los language sean English
fil.release_year = '' #vaciar release year porque está vacia
fil.original_language = '' #vaciar original language porque son todo nulos y querremos llenarla en el futuro.
fil = fil.drop('last_update', axis = 1) #quitamos last_update

In [11]:
fil['actors'] = '' #creamos columna vacía
def actors(peli): #creamos función que saque los actores de esa peli
    act = []
    for i in old.index:
        if old.title[i] == peli:
            name = old.first_name[i] + ' ' + old.last_name[i]
            act.append(name)
    return ', '.join(act)

In [12]:
#los introducimos por cada fila
for i in fil.index:
    fil['actors'][i] = actors(fil.title[i])

In [13]:
fil['category'] = '' #creamos columna vacía
def categ(peli):  #creamos función que saque la categoría de esa peli
    categor = ''
    for i in old.index:
        if old.title[i] == peli:
            categor = cat[cat.category_id == old.category_id[i]].name.iloc[0]
            return categor
#Introducimos la categoría en cada fila
for i in fil.index:
    fil['category'][i] = categ(fil.title[i])

In [14]:
fil.category.fillna('', inplace=True) # Rellenamos los valores vacíos de category con '' (nada).

In [15]:
fil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   film_id            1000 non-null   int64
 1   title              1000 non-null   object
 2   description        1000 non-null   object
 3   release_year       1000 non-null   object
 4   language           1000 non-null   object
 5   original_language  1000 non-null   object
 6   rental_duration    1000 non-null   int64
 7   rental_rate        1000 non-null   float64
 8   length             1000 non-null   int64
 9   replacement_cost   1000 non-null   float64
 10  rating             1000 non-null   object
 11  special_features   1000 non-null   object
 12  actors             1000 non-null   object
 13  category           1000 non-null   object
dtypes: float64(2), int64(3), object(9)
memory usage: 109.5+ KB

In [16]:
cus = pd.DataFrame({'customer_id': range(1, 598)})
cus['name'] = ''
cus['lastname'] = ''
cus['telephone'] = ''
cus['mail'] = ''

In [17]:
%pip install pymysql

Requirement already satisfied: pymysql in c:\users\manue\anaconda3\lib\site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [18]:
from sqlalchemy import create_engine

In [19]:
# cargar archivo de contraseñas

with open(r"C:\Users\manue\OneDrive\Escritorio\Ironhack\w3-database-project\password.txt") as file:
    
    passwd = file.read().split('\n')[0]

In [20]:
str_conn = f'mysql+pymysql://root:{passwd}@localhost:3306/blockbuster'
cursor = create_engine(str_conn)

ren.to_sql('rental',con=cursor, if_exists='replace', index=False)
inv.to_sql('inventory',con=cursor, if_exists='replace', index=False)
fil.to_sql('films',con=cursor, if_exists='replace', index=False)
cus.to_sql('customer',con=cursor, if_exists='replace', index=False)

597

In [21]:
act.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [22]:
cat.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [23]:
fil.head()

,film_id,title,description,release_year,language,original_language,rental_duration,rental_rate,length,replacement_cost,rating,special_features,actors,category
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies,,English,,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes","PENELOPE GUINESS, CHRISTIAN GABLE, LUCILLE TRACY, SANDRA PECK",Documentary
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient C...,,English,,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",BOB FAWCETT,Horror
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory,,English,,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes","NICK WAHLBERG, BOB FAWCETT, CAMERON STREEP",Documentary
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank,,English,,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",,
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist ...,,English,,6,2.99,130,22.99,G,Deleted Scenes,,

In [24]:
inv.head(5)

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

In [25]:
lan.head(5)

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [26]:
old.head(5)

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [27]:
ren.head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [29]:
act[act.first_name == 'SUSAN']

     actor_id first_name last_name          last_update
100       101      SUSAN     DAVIS  2006-02-15 04:34:33
109       110      SUSAN     DAVIS  2006-02-15 04:34:33

In [30]:
year = []
for i in ren.rental_date:
    year.append(i[0:4])
set(year)

{'2005'}